# **Aim: Conversion from different formats to HORUS format.CSV**

# A. CSV to HORUS

In [5]:
import pandas as pd

In [6]:
from datetime import datetime

In [7]:
df=pd.read_csv("C:/Users/ACER/Downloads/CSV FILE-20250324T162931Z-001/CSV FILE/Country_code.csv", encoding="UTF-8")

In [8]:
print(df)

                       Country ISO-2-CODE ISO-3-Code  ISO-M49
0                  Afghanistan         AF        AFG        4
1                Aland Islands         AX        ALA      248
2                      Albania         AL        ALB        8
3                      Algeria         DZ        DZA       12
4               American Samoa         AS        ASM       16
..                         ...        ...        ...      ...
242  Wallis and Futuna Islands         WF        WLF      876
243             Western Sahara         EH        ESH      732
244                      Yemen         YE        YEM      887
245                     Zambia         ZM        ZMB      894
246                   Zimbabwe         ZW        ZWE      716

[247 rows x 4 columns]

In [9]:
processdata=df

In [10]:
processdata.drop("ISO-2-CODE", axis=1)

                       Country ISO-3-Code  ISO-M49
0                  Afghanistan        AFG        4
1                Aland Islands        ALA      248
2                      Albania        ALB        8
3                      Algeria        DZA       12
4               American Samoa        ASM       16
..                         ...        ...      ...
242  Wallis and Futuna Islands        WLF      876
243             Western Sahara        ESH      732
244                      Yemen        YEM      887
245                     Zambia        ZMB      894
246                   Zimbabwe        ZWE      716

[247 rows x 3 columns]

In [11]:
processdata.drop("ISO-2-CODE", axis=1, inplace=True)

In [12]:
processdata.drop("ISO-3-Code", axis=1, inplace=True)

In [13]:
processdata

                       Country  ISO-M49
0                  Afghanistan        4
1                Aland Islands      248
2                      Albania        8
3                      Algeria       12
4               American Samoa       16
..                         ...      ...
242  Wallis and Futuna Islands      876
243             Western Sahara      732
244                      Yemen      887
245                     Zambia      894
246                   Zimbabwe      716

[247 rows x 2 columns]

In [14]:
new=datetime.now()

In [15]:
new

datetime.datetime(2025, 3, 24, 22, 13, 1, 860878)

In [16]:
dt_string=new.strftime("%d-%m-%y %H:%M:%S")
print("Date and Time: ", dt_string)

Date and Time:  24-03-25 22:13:01

In [17]:
f=open("CountryCode.txt", "a")
f.write("Deleting cloumn activity recorded ")
f.write(dt_string)
f.close()

In [18]:
processdata.rename(columns={"Country":"CountryName"}, inplace=True)

In [19]:
processdata

                   CountryName  ISO-M49
0                  Afghanistan        4
1                Aland Islands      248
2                      Albania        8
3                      Algeria       12
4               American Samoa       16
..                         ...      ...
242  Wallis and Futuna Islands      876
243             Western Sahara      732
244                      Yemen      887
245                     Zambia      894
246                   Zimbabwe      716

[247 rows x 2 columns]

In [20]:
processdata.rename(columns={"ISO-M49":"Code"}, inplace=True)
processdata

                   CountryName  Code
0                  Afghanistan     4
1                Aland Islands   248
2                      Albania     8
3                      Algeria    12
4               American Samoa    16
..                         ...   ...
242  Wallis and Futuna Islands   876
243             Western Sahara   732
244                      Yemen   887
245                     Zambia   894
246                   Zimbabwe   716

[247 rows x 2 columns]

In [21]:
processdata.set_index("Code", inplace=True)

In [22]:
processdata

                    CountryName
Code
4                   Afghanistan
248               Aland Islands
8                       Albania
12                      Algeria
16               American Samoa
...                         ...
876   Wallis and Futuna Islands
732              Western Sahara
887                       Yemen
894                      Zambia
716                    Zimbabwe

[247 rows x 1 columns]

In [23]:
processdata.sort_values("CountryName", axis=0, ascending=False, inplace=True)

In [24]:
processdata

                    CountryName
Code
716                    Zimbabwe
894                      Zambia
887                       Yemen
732              Western Sahara
876   Wallis and Futuna Islands
...                         ...
16               American Samoa
12                      Algeria
8                       Albania
248               Aland Islands
4                   Afghanistan

[247 rows x 1 columns]

In [25]:
OutputFileName="Hours_Country_Code.csv"
processdata.to_csv(OutputFileName, index=False)